# **Veri Setlerini Birleştirmek**

Bu linkte sonsuzdan biraz az sayıda örnek mevcut

https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html

In [57]:
import numpy as np
import pandas as pd

## .concat()

In [58]:
AB = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [59]:
CD = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [60]:
df_AB = pd.DataFrame(AB)
df_CD = pd.DataFrame(CD)

In [61]:
df_AB

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [62]:
df_CD

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [63]:
# help(pd.concat)

In [64]:
pd.concat([df_AB, df_CD])
# axis = 0 default

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [65]:
pd.concat([df_AB, df_CD], axis= 0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [66]:
pd.concat([df_AB, df_CD], axis= 1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [67]:
df_AB.columns = df_CD.columns

In [68]:
pd.concat([df_AB,df_CD])
# Sütun başlıkları A B olmadı çünkü = ifadesi sağdan sola okunur.
# Veya başka bir ifadeyse soldakini sağdakine eşitler.

    C   D
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

___
___

## .merge()

In [69]:
# help(pd.merge)

In [91]:
kayit = pd.DataFrame({'kayit_id':[1,2,3,4],'isim':['Demirel','Ecevit','Erbakan','Özal']})
giris = pd.DataFrame({'giris_id':[1,2,3,4],'isim':['Çiller','Demirel','Ecevit','Yılmaz']})

In [92]:
kayit

   kayit_id     isim
0         1  Demirel
1         2   Ecevit
2         3  Erbakan
3         4     Özal

In [93]:
giris

   giris_id     isim
0         1   Çiller
1         2  Demirel
2         3   Ecevit
3         4   Yılmaz

In [94]:
pd.merge(kayit,giris,how="inner")
# Sadece ortak ada sahip verileri işler

   kayit_id     isim  giris_id
0         1  Demirel         2
1         2   Ecevit         3

In [95]:
pd.merge(kayit,giris,how="inner", on="isim")
# Üstteki ile aynı. Pandas kolondaki string veriler ile int verileri ayırabiliyor.
# Birden fazla string verisi varsa on= konutunu kullanmanı öneririm.

   kayit_id     isim  giris_id
0         1  Demirel         2
1         2   Ecevit         3

In [96]:
pd.merge(kayit,giris,how="right")
# Sağdaki tabloyu temel alır ve soldakileri ona göre gösterir

   kayit_id     isim  giris_id
0       NaN   Çiller         1
1       1.0  Demirel         2
2       2.0   Ecevit         3
3       NaN   Yılmaz         4

In [97]:
pd.merge(kayit,giris,how="left")
# Soldaki tabloyu temel alır ve sağdakileri ona göre gösterir

   kayit_id     isim  giris_id
0         1  Demirel       2.0
1         2   Ecevit       3.0
2         3  Erbakan       NaN
3         4     Özal       NaN

In [98]:
pd.merge(kayit,giris,how='outer')
# Soldakini bastırır ve sağdakileri eşler. Olmayan verileri de NaN ile doldurur

   kayit_id     isim  giris_id
0       1.0  Demirel       2.0
1       2.0   Ecevit       3.0
2       3.0  Erbakan       NaN
3       4.0     Özal       NaN
4       NaN   Çiller       1.0
5       NaN   Yılmaz       4.0

In [99]:
giris = giris.set_index("isim")

In [100]:
giris

         giris_id
isim
Çiller          1
Demirel         2
Ecevit          3
Yılmaz          4

In [101]:
pd.merge(giris,kayit,left_index=True, right_on="isim")

   giris_id  kayit_id     isim
0         2         1  Demirel
1         3         2   Ecevit

In [102]:
pd.merge(kayit,giris,right_index=True, left_on="isim")

   kayit_id     isim  giris_id
0         1  Demirel         2
1         2   Ecevit         3

In [103]:
giris = giris.reset_index()

In [104]:
giris

      isim  giris_id
0   Çiller         1
1  Demirel         2
2   Ecevit         3
3   Yılmaz         4

In [105]:
kayit

   kayit_id     isim
0         1  Demirel
1         2   Ecevit
2         3  Erbakan
3         4     Özal

In [106]:
kayit.columns = ["kayit_id","kayit_adi"]
kayit

   kayit_id kayit_adi
0         1   Demirel
1         2    Ecevit
2         3   Erbakan
3         4      Özal

In [107]:
pd.merge(kayit,giris,left_on="kayit_adi", right_on="isim")

   kayit_id kayit_adi     isim  giris_id
0         1   Demirel  Demirel         2
1         2    Ecevit   Ecevit         3

In [108]:
pd.merge(kayit,giris,left_on='kayit_adi',right_on='isim').drop('isim',axis=1)

   kayit_id kayit_adi  giris_id
0         1   Demirel         2
1         2    Ecevit         3

In [111]:
kayit.columns = ["id","isim"]
giris.columns = ["isim","id"]

In [112]:
kayit

   id     isim
0   1  Demirel
1   2   Ecevit
2   3  Erbakan
3   4     Özal

In [113]:
giris

      isim  id
0   Çiller   1
1  Demirel   2
2   Ecevit   3
3   Yılmaz   4

In [115]:
pd.merge(kayit,giris, on="isim")
# _x sol
# _y sağ

   id_x     isim  id_y
0     1  Demirel     2
1     2   Ecevit     3

In [118]:
pd.merge(kayit,giris, on="isim", suffixes=("_kayit","_giris"))

   id_kayit     isim  id_giris
0         1  Demirel         2
1         2   Ecevit         3

___
___

# **Eline Sağlık Sülüman**